HelloWorldApp2/test/TestHelloWorld/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://helloworld.ws">
  <soapenv:Body>
    <hel:HelloWorld>
      <part1>World</part1>
    </hel:HelloWorld>
  </soapenv:Body>
</soapenv:Envelope>